content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+author: Eirik Haustveit

* DONE Org-mode feature testing                             :tag2:@category1:
CLOSED: [2025-06-07 la. 23:42]
:PROPERTIES:
:EXPORT_FILE_NAME: second-orgmode-post
:END:

This is the second org-mode test to see how various org-mode features looks with different Hugo templates.

** DONE Lists and checkboxes                                      :@feature:
CLOSED: [2025-06-08 su. 15:35]

- [ ] Dette er ein test
- [X] Dette er ein test
- [X] Dette er ein test

** Pictures

** Text formatting

- We can have *bold* text
- Also /italic/
- And =monospace=
- For key bindings ~C-c~
- And when you +regret something+
- And when _someting is really important_

** Tables

[[info:org#Column formulas][org#Column formulas]]

#+caption: First demo table
|  A |  B |  C |
|  2 |  3 |  4 |
|  5 | 10 | 21 |
| 33 | 43 | 11 |
|    |    |    |
|----+----+----|

#+caption: Table with verbatim CSS
#+attr_html: :class zebra-striping sane-table
|---+---|
| a | b |
| b | s |
|   |   |

*** Spreadsheet

The tables in org-mode are a spreadsheet.

| Candidate |  A |  B |   C |  D |  Mean | Std. dev |  RMS |
|-----------+----+----+-----+----+-------+----------+------|
|         1 | 50 | 25 | 100 | 10 | 46.25 |     39.4 | 57.5 |
|         2 | 75 | 25 |  75 | 50 | 56.25 |     23.9 | 59.9 |
|         3 | 50 | 75 |  60 | 25 |  52.5 |     21.0 | 55.6 |
#+TBLFM: $6=vmean($2..$5)
#+TBLFM: $7=vsdev($2..$5);%.1f
#+TBLFM: $8=rms($2..$5);%.1f

*** Plotting

Org-mode supports plotting through gnuplot.

#+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
     | Sede      | Max cites | H-index |
     |-----------+-----------+---------|
     | Chile     |    257.72 |   21.39 |
     | Leeds     |    165.77 |   19.68 |
     | Sao Paolo |     71.00 |   11.50 |
     | Stockholm |    134.19 |   14.33 |
     | Morelia   |    257.56 |   17.67 |


#+tblname: data-table
| x | y1 | y2 |
|---+----+----|
| 0 |  3 |  6 |
| 1 |  4 |  7 |
| 2 |  5 |  8 |

# #+begin_src gnuplot :var data=data-table :file output.png
#   f(x) = x**2
#   plot f(x)
# #+end_src


** Code listings

This is a code listing for C:

#+begin_src C
  #include <stdio.h>
  
  int main(){
    printf("Dette er ein test");
  }
#+end_src

#+RESULTS:
: Dette er ein test

** PlantUML

#+begin_src c :file images/demo-uml.png
  !theme spacelab
  a -> b
  b -> c
#+end_src


#+begin_src c :results verbatim
Bob -> Alice : Hello World!
#+end_src

** Citation

** Math
Inline math \(R = \frac{U}{I}\)

\[f(x) = \int_{2}^{4} x^{4}+2x^{3}\]

\begin{equation}
\label{eq:1}
C = W\log_{2} (1+\mathrm{SNR})
\end{equation}


